# 빅데이터 분석기사 실기 준비를 위한 캐글 놀이터
https://www.kaggle.com/datasets/agileteam/bigdatacertificationkr?resource=download

### 이상치(IQR) ⭐⭐⭐

#### 데이터에서 IQR을 활용해 Fare컬럼의 이상치를 찾고, 이상치 데이터의 여성 수를 구하시오
강의 영상 : https://youtu.be/ipBW5D_UJEo  
데이터셋 : Titanic  
데이터 위치 "../data/Titanic.csv"

In [1]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np
df = pd.read_csv("../data/Titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [2]:
# 간단한 탐색적 데이터 분석 (EDA)
print(df.shape)
print(df.describe())
print(df.isnull().sum())
df.head()

(891, 12)
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# IQR 구하기
Q1 = df["Fare"].quantile(0.25)
Q3 = df["Fare"].quantile(0.75)
IQR = Q3 - Q1

print(Q1 - 1.5 * IQR, Q3 + 1.5 * IQR)

-26.724 65.6344

In [4]:
# 이상치 데이터 구하기
outdata1 = df[df["Fare"] < Q1 - 1.5 * IQR]
outdata2 = df[df["Fare"] > Q3 + 1.5 * IQR]

print(len(outdata1), len(outdata2))

0 116

In [5]:
# 이상치 데이터에서 여성 수 구하기, 출력하기 print()
print(len(outdata2[outdata2["Gender"] == "female"]))

70

### 이상치(소수점 나이) ⭐⭐⭐

#### 이상치를 찾아라(소수점 나이)
주어진 데이터에서 이상치(소수점 나이)를 찾고 올림, 내림, 버림(절사)했을때 3가지 모두 이상치 'age' 평균을 구한 다음 모두 더하여 출력하시오  
데이터셋 : basic1.csv  
강의 영상 : https://youtu.be/c3Fr9G-ZYdw

In [6]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np

df = pd.read_csv("../data/basic1.csv")
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [7]:
# 소수점 데이터 찾기
df[df["age"] != df["age"].astype("int")]

      id   age city    f1  f2   f3    f4         f5
6   id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
8   id09   3.3   서울  35.0   2  NaN  ESFJ  17.252986
21  id22  -6.3   부산  72.0   1  NaN  ENFP  52.667078
28  id29 -13.5   부산  47.0   2  NaN  ENTP  67.886373
46  id47  34.6   대구  75.0   1  NaN  ESTJ  90.496999
64  id65  26.5   경기   NaN   0  NaN  ISFP  91.297791
84  id85  83.6   경기  55.0   0  NaN  INFJ  80.138280
92  id93  21.8   경기  57.0   0  NaN  ISFP  73.586397

In [8]:
# 이상치를 포함한 데이터 올림, 내림, 버림의 평균값 
# 올림
m_ceil = np.ceil(df["age"]).mean()

# 내림
m_floor = np.floor(df["age"]).mean()

# 버림
m_trunc = np.trunc(df["age"]).mean()

print(m_ceil, m_floor, m_trunc)

51.0 50.92 50.94

In [9]:
# 평균값 더한 다음 출력
print(m_ceil + m_floor + m_trunc)

152.86

### 결측치 처리 ⭐⭐⭐

#### 결측치 처리
주어진 데이터에서 결측치가 80%이상 되는 컬럼은(변수는) 삭제하고, 80% 미만인 결측치가 있는 컬럼은 'city'별 중앙값으로 값을 대체하고 'f1'컬럼의 평균값을 출력하세요!
데이터셋 : basic1.csv  
강의 영상 : https://youtu.be/WqlpqBRn7x4

In [10]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np

df = pd.read_csv("../data/basic1.csv")
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [11]:
# EDA - 결측값 확인(비율 확인)
print(df.shape)
print(df.isnull().sum() / len(df))

(100, 8)
id      0.00
age     0.00
city    0.00
f1      0.31
f2      0.00
f3      0.95
f4      0.00
f5      0.00
dtype: float64

In [12]:
# 80%이상 결측치 컬럼, 삭제
print("삭제 전:", df.shape)
df = df.drop(["f3"], axis = 1)
print("삭제 후:", df.shape)

삭제 전: (100, 8)
삭제 후: (100, 7)

In [13]:
# 80%미만 결측치 컬럼, city별 중앙값으로 대체
print(df["city"].unique())

## city별 중앙값 계산
s_md, b_md, d_md, k_md = df.groupby("city")["f1"].median()

## 중앙값 대체
df2 = df.copy()
df2["f1"] = df2["f1"].fillna(df["city"].map({"서울" : s_md, "부산" : b_md, "대구" : d_md, "경기" : k_md}))
display(df[18:21])
display(df2[18:21])

['서울' '부산' '대구' '경기']

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울   NaN   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산   NaN   1  ISFP  29.269869

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울  58.0   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산  75.0   1  ISFP  29.269869

In [14]:
# f1 평균값 결과 출력
print(df["f1"].mean()) # 총 평균
print(df.groupby("city")["f1"].mean()) # 도시별 평균

66.04347826086956
city
경기    62.551724
대구    74.846154
부산    62.583333
서울    67.933333
Name: f1, dtype: float64

### 왜도/첨도 (로그스케일) ⭐

In [ ]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np

# df = pd.read_csv("https://www.kaggle.com/c/house-prices-advanced-regression-techniques")
# df.head()

# 'SalePrice'컬럼 왜도와 첨도계산 
# df["SalePrice"].skew() # 왜도
# df["SalePrice"].kurt() # 첨도

# 'SalePrice'컬럼 로그변환
# df["log_SalePrice"] = np.log1p(df['SalePrice'])

# 'log_SalePrice'컬럼 왜도와 첨도계산 
# df["log_SalePrice"].skew()
# df["log_SalePrice"].kurt()

ParserError: Error tokenizing data. C error: Expected 1 fields in line 9, saw 2

### 표준편차 ⭐⭐⭐

#### 조건에 맞는 데이터 표준편차 구하기  
주어진 데이터 중 basic1.csv에서 'f4'컬럼 값이 'ENFJ'와 'INFP'인 'f1'의 표준편차 차이를 절대값으로 구하시오  
데이터셋 : basic1.csv

In [19]:
df = pd.read_csv("../data/basic1.csv")

In [23]:
abs(df[df["f4"] == "ENFJ"]["f1"].std() - df[df["f4"] == "INFP"]["f1"].std())

np.float64(5.859621525876811)

### Groupby 합계 ⭐⭐⭐

#### 결측치 제거 및 그룹 합계에서 조건에 맞는 값 찾아 출력
주어진 데이터 중 basic1.csv에서 'f1'컬럼 결측 데이터를 제거하고, 'city'와 'f2'을 기준으로 묶어 합계를 구하고, 'city가 경기이면서 f2가 0'인 조건에 만족하는 f1 값을 구하시오  
데이터셋 : basic1.csv

In [28]:
df = pd.read_csv("../data/basic1.csv")

In [30]:
df.dropna(subset=['f1'])

       id   age city    f1  f2   f3    f4         f5
1    id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
4    id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869
5    id06  22.0   서울  57.0   0  vip  INTP  20.129444
6    id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
..    ...   ...  ...   ...  ..  ...   ...        ...
94   id95  77.0   경기  43.0   1  NaN  INTJ  91.297791
95   id96  92.0   경기  53.0   1  NaN  ENTJ  52.667078
97   id98  39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99   1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100  47.0   경기  53.0   0  vip  ESFP  33.308999

[69 rows x 8 columns]

In [35]:
target = df.groupby(["city", "f2"]).sum()
target

                                                        id     age     f1  \
city f2
경기   0   id60id62id65id69id72id74id75id76id77id79id80id...  1088.9  833.0
     1   id63id66id67id70id73id78id81id83id87id89id92id...   976.0  670.0
     2                                id61id64id68id71id98   239.0  311.0
대구   0        id40id41id43id44id45id46id48id49id51id53id57   578.0  527.0
     1                            id47id50id52id54id56id59   393.6  235.0
     2                                        id42id55id58   140.0  211.0
부산   0                id24id25id27id30id31id32id33id37id39   481.0  389.0
     1                    id21id22id23id26id28id34id36id38   430.7  315.0
     2                                            id29id35    16.5   47.0
서울   0                        id01id06id11id12id13id16id19   220.0  278.0
     1                id02id03id07id08id10id14id15id17id20   389.3  534.0
     2                                    id04id05id09id18   143.3  207.0

          f3                                                 f4           f5
city f2
경기   0   vip  ESFPINTPISFPESTJESTJESTPESTPENTJINFPINTJISFPEN...  1391.927648
     1   vip  ISFJISFPISFJISTPISFJINTJISFJENTPISFPENTJINFPES...   935.958628
     2     0                               INTPESFPISFPISFPINFP   362.300060
대구   0     0       ENFPENFJISTPINTPENFJESTJENFPINTPISTJESTPISFJ   371.184620
     1   vip                           ESTJENFPISFJENFJESTJESFJ   404.779978
     2     0                                       ESTPENTPESTP    79.667919
부산   0   vip               INFJESTPESTPESTJESFJISFJENFJESTPINFJ   395.272907
     1     0                   ISFPENFPISTPENFPENTPINFPINTPESTP   460.657406
     2     0                                           ENTPESTJ   101.195372
서울   0   vip                       ENFJINTPENFPESTPESFJESFPISFP   484.809540
     1     0               ENFJISTJISFJINFJISFPENTJENTPISTPINTJ   506.371383
     2     0                                   INFPISFJESFJISFJ   179.328213

In [36]:
print(target.iloc[0]['f1'])

833.0

### 값 변경 ⭐⭐⭐

#### f4'컬럼의 값이 'ESFJ'인 데이터를 'ISFJ'로 대체하고, 'city'가 '경기'이면서 'f4'가 'ISFJ'인 데이터 중 'age'컬럼의 최대값을 출력하시오!
데이터셋 : basic1.csv

In [38]:
df = pd.read_csv("../data/basic1.csv")
df['f4'] = df['f4'].replace('ESFJ', 'ISFJ')

In [40]:
df[(df["city"] == "경기") & (df["f4"] == "ISFJ")]["age"].max()

np.float64(90.0)

###  누적합/보간 ⭐⭐⭐

#### 주어진 데이터 셋에서 'f2' 컬럼이 1인 조건에 해당하는 데이터의 'f1'컬럼 누적합을 계산한다. 이때 발생하는 누적합 결측치는 바로 뒤의 값을 채우고, 누적합의 평균값을 출력한다. (단, 결측치 바로 뒤의 값이 없으면 다음에 나오는 값을 채워넣는다)  
데이터셋 : basic1.csv

In [42]:
df = pd.read_csv("../data/basic1.csv")
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [45]:
df2 = df[df["f2"] == 1]["f1"].cumsum()
df2

1       70.0
2      131.0
6      191.0
7      292.0
9      366.0
13     416.0
14     483.0
16       NaN
19     534.0
20       NaN
21     606.0
22     681.0
25     738.0
27     772.0
33       NaN
35     849.0
37       NaN
46     924.0
49    1002.0
51    1084.0
53       NaN
55       NaN
58       NaN
62    1170.0
65       NaN
66    1222.0
69    1318.0
72       NaN
77    1414.0
80    1464.0
82    1514.0
86       NaN
88    1580.0
91    1658.0
93       NaN
94    1701.0
95    1754.0
Name: f1, dtype: float64

In [46]:
df2.fillna(method = "bfill").mean()

C:\Users\cho03\AppData\Local\Temp\ipykernel_7620\384758418.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2.fillna(method = "bfill").mean()

np.float64(980.3783783783783)

### 표준화 (중앙값) ⭐⭐⭐

#### 수치형 변수 변환하기
주어진 데이터에서 'f5'컬럼을 표준화(Standardization (Z-score Normalization))하고 그 중앙값을 구하시오  
데이터셋 : basic1.csv

In [61]:
from sklearn.preprocessing import StandardScaler

df = pd.read_csv("../data/basic1.csv")

scaler = StandardScaler()
df["f5"] = scaler.fit_transform(df[["f5"]])

In [62]:
df["f5"].median()

np.float64(0.260619629559015)

In [63]:
display(df["f5"].head())
display(df[["f5"]].head())

0    1.220815
1    0.127343
2   -1.394535
3   -0.143667
4   -0.970085
Name: f5, dtype: float64

         f5
0  1.220815
1  0.127343
2 -1.394535
3 -0.143667
4 -0.970085

###  Yeo-Johnson & Box-Cox ⭐

### min-max scaling ⭐⭐⭐

In [64]:
# min-max스케일링 기준 상하위 5% 구하기
# 주어진 데이터에서 'f5'컬럼을 min-max 스케일 변환한 후, 상위 5%와 하위 5% 값의 합을 구하시오

# - 데이터셋 : basic1.csv
# - 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
# - File -> Editor Type -> Script

df = pd.read_csv("../data/basic1.csv")

In [67]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
df["f5"] = scaler.fit_transform(df[["f5"]])
df["f5"].quantile(0.05) + df["f5"].quantile(0.95)

np.float64(1.0248740983597389)

###  상하위 10개 추출 ⭐⭐⭐

     id   age city    f1  f2   f3    f4        f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  0.919533
1  id02   9.0   서울  70.0   1  NaN  ENFJ  0.570252
2  id03  27.0   서울  61.0   1  NaN  ISTJ  0.084129
3  id04  75.0   서울   NaN   2  NaN  INFP  0.483685
4  id05  24.0   서울  85.0   2  NaN  ISFJ  0.219708
id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64
     id   age city    f1  f2   f3    f4        f5      f5_1      f5_2
0  id01   2.0   서울   NaN   0  NaN  ENFJ  0.919533  0.919533  0.919533
1  id02   9.0   서울  70.0   1  NaN  ENFJ  0.570252  0.570252  0.570252
2  id03  27.0   서울  61.0   1  NaN  ISTJ  0.084129  0.084129  0.084129
3  id04  75.0   서울   NaN   2  NaN  INFP  0.483685  0.483685  0.483685
4  id05  24.0   서울  85.0   2  NaN  ISFJ  0.219708  0.219708  0.219708
0.03670782406038746
0.9881662742993513
1.0248740983597389

### 상과관계 ⭐⭐⭐

### MultiIndex + Groupby ⭐⭐⭐

### 조건 필터림 + 중앙값 대체 ⭐⭐⭐

### 분산 계산 ⭐⭐⭐

### 시계열1 (datetime) ⭐⭐⭐

### 시계열2 (평일/주말) ⭐⭐⭐

### 시계열3 (월별 총계) ⭐⭐⭐

### 데이터 병합 ⭐

### Binning Data ⭐

### 시계열 (Weekly) ⭐⭐⭐

### 중복 제거 및 결측치 처리 ⭐⭐⭐

### Lagged Feature

### 문자열 처리 (슬라이싱)

### 문자열 포함 여부

### 문자열 치환

### 빈도 계산 (value_counts)

### 날짜 형식 변환

### 시계열 비율 계산

### Melt 전체

### Melt 일부

### Timedelta 계산

### 패턴/선호도 분석 (난이도 : 상)

### 피드백-문자와 시계열 (난이도 : 중)